system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


regions
(
    cylinderToCell 
    {
        p1 (0 0 0);
        p2 (0 0 0.5);
        radius 0.1;
        fieldValues
        (
            volScalarFieldValue T 2300//2000
        );
    }
);


// ************************************************************************* //
